geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
#include <ctype.h>
#include <limits.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "sa818_radio.h"
#if CONFIG_IDF_TARGET_ESP32
#include "driver/i2s.h"
#include "driver/dac.h"
#endif
#include "driver/dac_oneshot.h"
#include "driver/gpio.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

static const char *TAG = "sa818_radio";

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

#define SA818_RADIO_CMD_TIMEOUT_MS      1500
#define SA818_RADIO_RX_TASK_STACK       8192
#define SA818_RADIO_RX_TASK_PRIO        4
#define SA818_RADIO_AUDIO_BLOCK_SAMPLES 160

#define APRS_SAMPLE_RATE_HZ             9600U
#define APRS_SAMPLES_PER_BIT            (APRS_SAMPLE_RATE_HZ / APRS_BITRATE_BPS)
#define APRS_MARK_FREQ_HZ               1200.0f
#define APRS_SPACE_FREQ_HZ              2200.0f
#define APRS_BITRATE_BPS                1200U
#define APRS_DEMOD_DELAY_SAMPLES        ((APRS_SAMPLE_RATE_HZ + APRS_BITRATE_BPS) / (2U * APRS_BITRATE_BPS))
#define APRS_FIR_TAPS                   31U
#define APRS_PHASE_BITS                 8
#define APRS_PHASE_INC                  1
#define APRS_PHASE_MAX                  ((APRS_SAMPLE_RATE_HZ / APRS_BITRATE_BPS) * APRS_PHASE_BITS)
#define APRS_PHASE_THRESHOLD            (APRS_PHASE_MAX / 2)
#define APRS_PREAMBLE_FLAGS             350U
#define APRS_TAIL_FLAGS                 50U
#define APRS_TX_LEAD_MS                 250U
#define APRS_TX_TAIL_MS                 120U
#define APRS_MAX_FRAME_BYTES            330U
#define APRS_MAX_RAW_BITS               (APRS_MAX_FRAME_BYTES * 12U)
#define APRS_MAX_INFO_BYTES             120U
#define APRS_MAX_MESSAGE_SEQ            999U

#if CONFIG_IDF_TARGET_ESP32
#define APRS_I2S_SAMPLE_RATE_HZ         48000U
#define APRS_I2S_BITS_PER_SAMPLE        16
#define APRS_I2S_SAMPLES_PER_BIT        (APRS_I2S_SAMPLE_RATE_HZ / 1200U)
#define APRS_I2S_SIN_LEN                512U
#define APRS_I2S_TX_BLOCK_SAMPLES       320U
#define APRS_I2S_RF_LEVEL_SHIFT         7U
#define APRS_I2S_RF_LEVEL_OFFSET        10000U
#define APRS_I2S_PHASE_MARK_INC         ((uint16_t)(((APRS_I2S_SIN_LEN * APRS_MARK_FREQ_HZ) / APRS_I2S_SAMPLE_RATE_HZ) + 0.5f))
#define APRS_I2S_PHASE_SPACE_INC        ((uint16_t)(((APRS_I2S_SIN_LEN * APRS_SPACE_FREQ_HZ) / APRS_I2S_SAMPLE_RATE_HZ) + 0.5f))
#endif

#if CONFIG_IDF_TARGET_ESP32
// Quarter-wave table adapted from APRS-ESP LibAPRS_ESP32 (Afsk sin LUT path).
static const uint8_t s_aprs_sin_q[] = {
    128, 129, 131, 132, 134, 135, 137, 138, 140, 142, 143, 145, 146, 148, 149, 151,
    152, 154, 155, 157, 158, 160, 162, 163, 165, 166, 167, 169, 170, 172, 173, 175,
    176, 178, 179, 181, 182, 183, 185, 186, 188, 189, 190, 192, 193, 194, 196, 197,
    198, 200, 201, 202, 203, 205, 206, 207, 208, 210, 211, 212, 213, 214, 215, 217,
    218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
    234, 234, 235, 236, 237, 238, 238, 239, 240, 241, 241, 242, 243, 243, 244, 245,
    245, 246, 246, 247, 248, 248, 249, 249, 250, 250, 250, 251, 251, 252, 252, 252,
    253, 253, 253, 253, 254, 254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255,
    255,
};

static inline uint8_t aprs_sin_sample(uint16_t phase)
{
    uint16_t idx = phase % (APRS_I2S_SIN_LEN / 2U);
    if (idx >= (APRS_I2S_SIN_LEN / 4U)) {
        idx = (APRS_I2S_SIN_LEN / 2U) - idx - 1U;
    }
    uint8_t s = s_aprs_sin_q[idx];
    return (phase >= (APRS_I2S_SIN_LEN / 2U)) ? (uint8_t)(255U - s) : s;
}
#endif

typedef struct {
    uint8_t frame[APRS_MAX_FRAME_BYTES];
    size_t frame_len;
    uint8_t hdlc_demod_bits;
    uint8_t hdlc_bit_index;
    uint8_t hdlc_current_byte;
    bool hdlc_receiving;
    uint8_t probe_normal_bits;
    uint8_t probe_inverted_bits;
    bool polarity_locked;
    bool invert_nrzi_bits;
    uint8_t raw_bits[APRS_MAX_RAW_BITS];
    size_t raw_bits_len;

    int16_t delay_line[APRS_DEMOD_DELAY_SAMPLES];
    size_t delay_idx;

    int16_t lpf_coeff[APRS_FIR_TAPS];
    int16_t lpf_hist[APRS_FIR_TAPS];
    size_t lpf_index;
    int32_t discriminator_dc_q8;

    uint16_t sampled_bits;
    uint8_t actual_bits;
    int16_t current_phase;

    uint32_t nrzi_bits;
    uint32_t flag_seen;
    uint32_t frame_candidates;
    uint32_t crc_ok;
    uint32_t crc_fail;
} aprs_decoder_state_t;

struct sa818_radio_dev {
    sa818_handle_t modem;
    sa818_radio_config_t cfg;

    bool powered;
    bool ptt_enabled;
    bool high_power;
    float tx_freq_mhz;
    float rx_freq_mhz;
    float aprs_freq_mhz;
    uint8_t squelch;
    uint8_t bandwidth;

    bool adc_ready;
    adc_oneshot_unit_handle_t adc_unit;
    adc_channel_t adc_channel;

    bool dac_ready;
    dac_oneshot_handle_t dac_handle;
#if CONFIG_IDF_TARGET_ESP32
    bool i2s_tx_ready;
#endif

    volatile bool rx_task_running;
    TaskHandle_t rx_task;
    sa818_radio_audio_rx_cb_t audio_rx_cb;
    void *audio_rx_ctx;

    sa818_aprs_rx_cb_t aprs_rx_cb;
    void *aprs_rx_ctx;
    aprs_decoder_state_t aprs_dec;
    uint16_t aprs_message_seq;

    SemaphoreHandle_t lock;
};

static inline uint16_t aprs_crc16_update(uint16_t crc, uint8_t data)
{
    crc ^= data;
    for (int i = 0; i < 8; i++) {
        if ((crc & 0x0001U) != 0U) {
            crc = (uint16_t)((crc >> 1) ^ 0x8408U);
        } else {
            crc >>= 1;
        }
    }
    return crc;
}

static uint16_t aprs_crc16(const uint8_t *data, size_t len)
{
    uint16_t crc = 0xFFFFU;
    for (size_t i = 0; i < len; i++) {
        crc = aprs_crc16_update(crc, data[i]);
    }
    return (uint16_t)~crc;
}

static bool parse_callsign_ssid(const char *input,
                                char *callsign_out,
                                size_t callsign_out_len,
                                uint8_t *ssid_out)
{
    if (!input || !callsign_out || callsign_out_len < 7 || !ssid_out) {
        return false;
    }

    const char *dash = strchr(input, '-');
    size_t call_len = dash ? (size_t)(dash - input) : strlen(input);
    if (call_len == 0 || call_len > 6) {
        return false;
    }

    memset(callsign_out, 0, callsign_out_len);
    for (size_t i = 0; i < call_len; i++) {
        unsigned char c = (unsigned char)input[i];
        if (!isalnum(c)) {
            return false;
        }
        callsign_out[i] = (char)toupper(c);
    }

    uint8_t ssid = 0;
    if (dash != NULL) {
        char *endptr = NULL;
        long ssid_val = strtol(dash + 1, &endptr, 10);
        if (endptr == dash + 1 || *endptr != '\0' || ssid_val < 0 || ssid_val > 15) {
            return false;
        }
        ssid = (uint8_t)ssid_val;
    }

