geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
    *ssid_out = ssid;
    return true;
}

static void encode_ax25_address(const char *callsign, uint8_t ssid, bool last, uint8_t out[7])
{
    char padded[6] = {' ', ' ', ' ', ' ', ' ', ' '};
    size_t call_len = strlen(callsign);
    if (call_len > 6) {
        call_len = 6;
    }

    for (size_t i = 0; i < call_len; i++) {
        padded[i] = (char)toupper((unsigned char)callsign[i]);
    }

    for (int i = 0; i < 6; i++) {
        out[i] = (uint8_t)(padded[i] << 1);
    }

    out[6] = (uint8_t)((ssid & 0x0FU) << 1);
    out[6] |= 0x60U;
    if (last) {
        out[6] |= 0x01U;
    }
}

static void decode_ax25_address(const uint8_t in[7], char *out, size_t out_len)
{
    char callsign[7];
    size_t n = 0;

    for (int i = 0; i < 6; i++) {
        char c = (char)(in[i] >> 1);
        if (c == ' ') {
            continue;
        }
        if (n < sizeof(callsign) - 1) {
            callsign[n++] = c;
        }
    }
    callsign[n] = '\0';

    uint8_t ssid = (uint8_t)((in[6] >> 1) & 0x0FU);
    if (ssid == 0) {
        snprintf(out, out_len, "%s", callsign);
    } else {
        snprintf(out, out_len, "%s-%u", callsign, ssid);
    }
}

static void trim_right_spaces(char *str)
{
    if (!str) {
        return;
    }

    size_t len = strlen(str);
    while (len > 0 && str[len - 1] == ' ') {
        str[len - 1] = '\0';
        len--;
    }
}

static void sanitize_message_text(const char *in, char *out, size_t out_len)
{
    if (!out || out_len == 0) {
        return;
    }
    out[0] = '\0';

    if (!in) {
        return;
    }

    size_t out_idx = 0;
    for (size_t i = 0; in[i] != '\0' && out_idx + 1 < out_len; i++) {
        unsigned char c = (unsigned char)in[i];
        if (c < 32 || c > 126) {
            continue;
        }
        if (c == '{' || c == '|' || c == '~') {
            c = ' ';
        }
        out[out_idx++] = (char)c;
    }
    out[out_idx] = '\0';
}

static esp_err_t sa818_radio_apply_group(sa818_radio_handle_t handle)
{
    if (!handle || !handle->modem) {
        return ESP_ERR_INVALID_ARG;
    }

    return sa818_set_group(handle->modem,
                           handle->bandwidth,
                           handle->tx_freq_mhz,
                           handle->rx_freq_mhz,
                           "0000",
                           handle->squelch,
                           "0000",
                           SA818_RADIO_CMD_TIMEOUT_MS);
}

static esp_err_t sa818_radio_configure_squelch_pin(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

    if (handle->cfg.squelch_pin < 0) {
        return ESP_OK;
    }

    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << handle->cfg.squelch_pin),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    return gpio_config(&io_conf);
}

static esp_err_t sa818_radio_configure_adc(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

    if (handle->cfg.audio_in_pin < 0) {
        return ESP_OK;
    }

    adc_unit_t unit = ADC_UNIT_1;
    adc_channel_t channel = ADC_CHANNEL_0;
    esp_err_t ret = adc_oneshot_io_to_channel(handle->cfg.audio_in_pin, &unit, &channel);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Audio in GPIO%d is not ADC-capable (%s)",
                 handle->cfg.audio_in_pin, esp_err_to_name(ret));
        return ret;
    }

    if (unit != ADC_UNIT_1) {
        ESP_LOGW(TAG, "Audio in GPIO%d uses unsupported ADC unit %d", handle->cfg.audio_in_pin, unit);
        return ESP_ERR_NOT_SUPPORTED;
    }

    adc_oneshot_unit_init_cfg_t unit_cfg = {
        .unit_id = unit,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ret = adc_oneshot_new_unit(&unit_cfg, &handle->adc_unit);
    if (ret != ESP_OK) {
        return ret;
    }

    adc_oneshot_chan_cfg_t chan_cfg = {
        .bitwidth = ADC_BITWIDTH_12,
        .atten = ADC_ATTEN_DB_0,
    };
    ret = adc_oneshot_config_channel(handle->adc_unit, channel, &chan_cfg);
    if (ret != ESP_OK) {
        adc_oneshot_del_unit(handle->adc_unit);
        handle->adc_unit = NULL;
        return ret;
    }

    handle->adc_channel = channel;
    handle->adc_ready = true;
    return ESP_OK;
}

#if CONFIG_IDF_TARGET_ESP32
static esp_err_t sa818_radio_configure_i2s_tx(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    if (handle->cfg.audio_out_pin != 25 && handle->cfg.audio_out_pin != 26) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    // Match APRS-ESP behavior: keep I2S in stereo framing and mirror the same
    // sample on both channels, while enabling only the target DAC channel.
    i2s_channel_fmt_t channel_fmt = (handle->cfg.audio_out_pin == 25)
                                    ? I2S_CHANNEL_FMT_ALL_RIGHT
                                    : I2S_CHANNEL_FMT_ALL_LEFT;

    i2s_config_t i2s_cfg = {
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN),
        .sample_rate = APRS_I2S_SAMPLE_RATE_HZ,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = channel_fmt,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 2, 0)
        .communication_format = I2S_COMM_FORMAT_STAND_MSB,
#else
        .communication_format = I2S_COMM_FORMAT_I2S_MSB,
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 5,
        .dma_buf_len = 768,
        .use_apll = false,
        .tx_desc_auto_clear = true,
        .fixed_mclk = 0,
    };

    esp_err_t ret = i2s_driver_install(I2S_NUM_0, &i2s_cfg, 0, NULL);
    if (ret != ESP_OK) {
        return ret;
    }

    ret = i2s_set_pin(I2S_NUM_0, NULL);
    if (ret != ESP_OK) {
        i2s_driver_uninstall(I2S_NUM_0);
        return ret;
    }

    i2s_dac_mode_t dac_mode = (handle->cfg.audio_out_pin == 25) ? I2S_DAC_CHANNEL_RIGHT_EN : I2S_DAC_CHANNEL_LEFT_EN;
    ret = i2s_set_dac_mode(dac_mode);
    if (ret != ESP_OK) {
        i2s_driver_uninstall(I2S_NUM_0);
        return ret;
    }

    ret = i2s_zero_dma_buffer(I2S_NUM_0);
    if (ret != ESP_OK) {
        i2s_driver_uninstall(I2S_NUM_0);
        return ret;
    }

    dac_i2s_enable();

    handle->i2s_tx_ready = true;
    ESP_LOGI(TAG, "APRS TX using I2S+DAC on GPIO%d @ %u Hz", handle->cfg.audio_out_pin, APRS_I2S_SAMPLE_RATE_HZ);
    return ESP_OK;
}
#endif

static esp_err_t sa818_radio_configure_dac(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

    if (handle->cfg.audio_out_pin < 0) {
        return ESP_OK;
    }

    dac_channel_t channel;
    if (handle->cfg.audio_out_pin == 25) {
        channel = DAC_CHAN_0;
    } else if (handle->cfg.audio_out_pin == 26) {
        channel = DAC_CHAN_1;
    } else {
        ESP_LOGW(TAG, "Audio out GPIO%d does not map to built-in DAC (supported: 25,26)",
                 handle->cfg.audio_out_pin);
        return ESP_ERR_NOT_SUPPORTED;
    }

    dac_oneshot_config_t cfg = {
        .chan_id = channel,
    };
    esp_err_t ret = dac_oneshot_new_channel(&cfg, &handle->dac_handle);
    if (ret != ESP_OK) {
        return ret;
    }

    handle->dac_ready = true;
    dac_oneshot_output_voltage(handle->dac_handle, 128);
    return ESP_OK;
}

static uint8_t aprs_count_ones_u8(uint8_t value)
{
    uint8_t count = 0;
    while (value != 0U) {
        value &= (uint8_t)(value - 1U);
        count++;
    }
    return count;
}

static inline bool aprs_signal_transitioned(uint16_t bits)
{
    return ((((bits) ^ (bits >> 2)) & 0x03U) == 0x03U);
}

static inline bool aprs_transition_found(uint8_t bits)
{
    return (((bits) ^ (bits >> 1)) & 0x01U) != 0U;
}

