geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
static float aprs_sinc(float x)
{
    if (fabsf(x) < 1e-6f) {
        return 1.0f;
    }
    return sinf(x) / x;
}

static float aprs_windowf(float x)
{
    return 0.54f + 0.46f * cosf(x);
}

static void aprs_design_fir_bandpass(int16_t coeffs[APRS_FIR_TAPS], float pass_hz, float cutoff_hz)
{
    const int taps = (int)APRS_FIR_TAPS;
    const int mid = (taps - 1) / 2;
    const float rp = pass_hz / (float)APRS_SAMPLE_RATE_HZ;
    const float rc = cutoff_hz / (float)APRS_SAMPLE_RATE_HZ;
    const float amplitude = 32767.0f;

    for (int n = -mid; n <= mid; n++) {
        float coeff = amplitude * 2.0f
                      * ((rc * aprs_sinc(2.0f * (float)M_PI * rc * (float)n))
                         - (rp * aprs_sinc(2.0f * (float)M_PI * rp * (float)n)))
                      * aprs_windowf((float)M_PI * (float)n / (float)mid);
        coeffs[n + mid] = (int16_t)lrintf(coeff);
    }
}

static void aprs_decoder_init_demod(aprs_decoder_state_t *dec)
{
    if (!dec) {
        return;
    }

    memset(dec->delay_line, 0, sizeof(dec->delay_line));
    dec->delay_idx = 0;
    memset(dec->lpf_hist, 0, sizeof(dec->lpf_hist));
    dec->lpf_index = 0;
    dec->discriminator_dc_q8 = 0;
    dec->sampled_bits = 0;
    dec->actual_bits = 0;
    dec->current_phase = 0;
    dec->probe_normal_bits = 0U;
    dec->probe_inverted_bits = 0U;
    dec->polarity_locked = false;
    dec->invert_nrzi_bits = false;
    dec->raw_bits_len = 0U;
    dec->nrzi_bits = 0;
    dec->flag_seen = 0;
    dec->frame_candidates = 0;
    dec->crc_ok = 0;
    dec->crc_fail = 0;

    aprs_design_fir_bandpass(dec->lpf_coeff, 0.0f, 1200.0f);
}

static int16_t aprs_decoder_filter_core(const int16_t coeffs[APRS_FIR_TAPS],
                                        int16_t hist[APRS_FIR_TAPS],
                                        size_t *index,
                                        int16_t sample)
{
    hist[*index] = sample;

    int32_t sum = 0;
    for (size_t i = 0; i < APRS_FIR_TAPS; i++) {
        size_t idx = (*index + i) % APRS_FIR_TAPS;
        sum += (int32_t)coeffs[i] * (int32_t)hist[idx];
    }

    *index = (*index + APRS_FIR_TAPS - 1U) % APRS_FIR_TAPS;
    return (int16_t)(sum >> 16);
}

static void aprs_decoder_reset_frame(aprs_decoder_state_t *dec)
{
    dec->frame_len = 0;
    dec->hdlc_current_byte = 0;
    dec->hdlc_bit_index = 0;
}

typedef struct {
    char src[16];
    char dst[16];
    char path[80];
    char info[APRS_MAX_INFO_BYTES + 1];
} aprs_packet_t;

static bool aprs_decode_ax25_frame(const uint8_t *frame, size_t frame_len, aprs_packet_t *packet)
{
    if (!frame || !packet || frame_len < 18) {
        return false;
    }

    uint16_t expected_fcs = (uint16_t)(frame[frame_len - 2] | (frame[frame_len - 1] << 8));
    uint16_t computed_fcs = aprs_crc16(frame, frame_len - 2);
    if (computed_fcs != expected_fcs) {
        return false;
    }

    size_t idx = 0;
    const size_t payload_len = frame_len - 2;
    const uint8_t *addresses[8];
    size_t address_count = 0;
    bool last = false;

    while (!last) {
        if (idx + 7 > payload_len || address_count >= 8) {
            return false;
        }
        addresses[address_count] = &frame[idx];
        last = (frame[idx + 6] & 0x01U) != 0;
        idx += 7;
        address_count++;
    }

    if (address_count < 2 || idx + 2 > payload_len) {
        return false;
    }

    uint8_t control = frame[idx++];
    uint8_t pid = frame[idx++];
    if (control != 0x03U || pid != 0xF0U) {
        return false;
    }

    decode_ax25_address(addresses[0], packet->dst, sizeof(packet->dst));
    decode_ax25_address(addresses[1], packet->src, sizeof(packet->src));

    packet->path[0] = '\0';
    for (size_t i = 2; i < address_count; i++) {
        char hop[16];
        decode_ax25_address(addresses[i], hop, sizeof(hop));

        if (packet->path[0] != '\0') {
            strlcat(packet->path, ",", sizeof(packet->path));
        }
        strlcat(packet->path, hop, sizeof(packet->path));
    }

    size_t info_len = payload_len - idx;
    if (info_len > APRS_MAX_INFO_BYTES) {
        info_len = APRS_MAX_INFO_BYTES;
    }
    memcpy(packet->info, &frame[idx], info_len);
    packet->info[info_len] = '\0';
    return true;
}

static bool aprs_decoder_handle_complete_frame(sa818_radio_handle_t handle)
{
    if (!handle) {
        return false;
    }

    aprs_decoder_state_t *dec = &handle->aprs_dec;
    if (dec->frame_len < 18 || dec->hdlc_bit_index != 0) {
        return false;
    }

    aprs_packet_t packet;
    if (!aprs_decode_ax25_frame(dec->frame, dec->frame_len, &packet)) {
        return false;
    }

    char to_callsign[16];
    char message[APRS_MAX_INFO_BYTES + 1];
    snprintf(to_callsign, sizeof(to_callsign), "%s", packet.dst);
    snprintf(message, sizeof(message), "%s", packet.info);

    size_t info_len = strlen(packet.info);
    if (info_len >= 11 && packet.info[0] == ':' && packet.info[10] == ':') {
        char addressee[10];
        memcpy(addressee, &packet.info[1], 9);
        addressee[9] = '\0';
        trim_right_spaces(addressee);
        snprintf(to_callsign, sizeof(to_callsign), "%s", addressee);
        snprintf(message, sizeof(message), "%s", &packet.info[11]);
    }

    char raw_tnc2[256];
    if (packet.path[0] != '\0') {
        snprintf(raw_tnc2, sizeof(raw_tnc2), "%s>%s,%s:%s",
                 packet.src, packet.dst, packet.path, packet.info);
    } else {
        snprintf(raw_tnc2, sizeof(raw_tnc2), "%s>%s:%s",
                 packet.src, packet.dst, packet.info);
    }

    sa818_aprs_rx_cb_t cb = handle->aprs_rx_cb;
    if (cb != NULL) {
        cb(packet.src, to_callsign, message, raw_tnc2, handle->aprs_rx_ctx);
    }
    return true;
}

static uint8_t aprs_decoder_resolve_nrzi_polarity(aprs_decoder_state_t *dec, uint8_t raw_bit)
{
    uint8_t bit = (raw_bit != 0U) ? 1U : 0U;
    if (!dec->polarity_locked) {
        dec->probe_normal_bits = (uint8_t)((dec->probe_normal_bits << 1) | bit);
        dec->probe_inverted_bits = (uint8_t)((dec->probe_inverted_bits << 1) | (bit ^ 1U));
        if (dec->probe_normal_bits == 0x7EU) {
            dec->polarity_locked = true;
            dec->invert_nrzi_bits = false;
            dec->hdlc_demod_bits = 0U;
        } else if (dec->probe_inverted_bits == 0x7EU) {
            dec->polarity_locked = true;
            dec->invert_nrzi_bits = true;
            dec->hdlc_demod_bits = 0U;
        }
    }
    return dec->invert_nrzi_bits ? (uint8_t)(bit ^ 1U) : bit;
}

static bool aprs_decoder_try_raw_bits(sa818_radio_handle_t handle)
{
    if (!handle) {
        return false;
    }

    aprs_decoder_state_t *dec = &handle->aprs_dec;
    if (dec->raw_bits_len < 18U * 8U) {
        return false;
    }

    static uint8_t destuffed[APRS_MAX_FRAME_BYTES * 8U];
    static uint8_t frame_bytes[APRS_MAX_FRAME_BYTES];
    aprs_packet_t packet;

    for (uint8_t invert = 0; invert < 2U; invert++) {
        for (uint8_t shift = 0; shift < 8U && shift < dec->raw_bits_len; shift++) {
            size_t destuffed_len = 0;
            uint8_t ones = 0;
            bool invalid = false;

            for (size_t i = shift; i < dec->raw_bits_len; i++) {
                uint8_t bit = (uint8_t)(dec->raw_bits[i] ^ invert);
                if (bit != 0U) {
                    ones++;
                    if (ones > 6U || destuffed_len >= sizeof(destuffed)) {
                        invalid = true;
                        break;
                    }
                    destuffed[destuffed_len++] = 1U;
                } else {
                    if (ones == 5U) {
                        ones = 0U;
                        continue;
                    }
                    ones = 0U;
                    if (destuffed_len >= sizeof(destuffed)) {
                        invalid = true;
                        break;
                    }
                    destuffed[destuffed_len++] = 0U;
                }
            }

            if (invalid || destuffed_len < 18U * 8U) {
                continue;
            }

            size_t max_bytes = destuffed_len / 8U;
            if (max_bytes > APRS_MAX_FRAME_BYTES) {
                max_bytes = APRS_MAX_FRAME_BYTES;
            }

            for (size_t trim = 0; trim < 4U && max_bytes > (18U + trim); trim++) {
                size_t use_bytes = max_bytes - trim;
                for (size_t b = 0; b < use_bytes; b++) {
                    uint8_t v = 0U;
                    for (uint8_t k = 0; k < 8U; k++) {
                        if (destuffed[b * 8U + k] != 0U) {
                            v |= (uint8_t)(1U << k);
                        }
                    }
                    frame_bytes[b] = v;
                }

                if (aprs_decode_ax25_frame(frame_bytes, use_bytes, &packet)) {
                    memcpy(dec->frame, frame_bytes, use_bytes);
                    dec->frame_len = use_bytes;
                    dec->hdlc_bit_index = 0U;
                    return true;
                }
            }
        }
    }

