geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
    return false;
}

static void aprs_decoder_process_nrzi_bit(sa818_radio_handle_t handle, uint8_t bit)
{
    aprs_decoder_state_t *dec = &handle->aprs_dec;
    dec->nrzi_bits++;
    bit = aprs_decoder_resolve_nrzi_polarity(dec, bit);
    if (!dec->polarity_locked) {
        return;
    }

    dec->hdlc_demod_bits <<= 1;
    dec->hdlc_demod_bits |= (bit != 0U) ? 1U : 0U;

    if (dec->hdlc_demod_bits == 0x7EU) {
        dec->flag_seen++;
        if (dec->hdlc_receiving && dec->raw_bits_len >= (18U * 8U)) {
            dec->frame_candidates++;
            bool ok = false;
            if (dec->frame_len >= 18U && dec->hdlc_bit_index == 0U) {
                ok = aprs_decoder_handle_complete_frame(handle);
            }
            if (!ok && aprs_decoder_try_raw_bits(handle)) {
                ok = aprs_decoder_handle_complete_frame(handle);
            }
            if (ok) {
                dec->crc_ok++;
            } else {
                dec->crc_fail++;
            }
        }
        dec->hdlc_receiving = true;
        dec->raw_bits_len = 0U;
        aprs_decoder_reset_frame(dec);
        return;
    }

    // RESET pattern (continuous ones / invalid run)
    if ((dec->hdlc_demod_bits & 0x7FU) == 0x7FU) {
        dec->hdlc_receiving = false;
        dec->raw_bits_len = 0U;
        aprs_decoder_reset_frame(dec);
        dec->polarity_locked = false;
        dec->invert_nrzi_bits = false;
        dec->probe_normal_bits = 0U;
        dec->probe_inverted_bits = 0U;
        return;
    }

    if (!dec->hdlc_receiving) {
        return;
    }

    if (dec->raw_bits_len < APRS_MAX_RAW_BITS) {
        dec->raw_bits[dec->raw_bits_len++] = bit ? 1U : 0U;
    } else {
        dec->hdlc_receiving = false;
        dec->raw_bits_len = 0U;
        aprs_decoder_reset_frame(dec);
        return;
    }

    // Stuffed zero after five consecutive ones.
    if ((dec->hdlc_demod_bits & 0x3FU) == 0x3EU) {
        return;
    }

    if ((dec->hdlc_demod_bits & 0x01U) != 0U) {
        dec->hdlc_current_byte |= 0x80U;
    }

    if (++dec->hdlc_bit_index >= 8U) {
        if (dec->frame_len < sizeof(dec->frame)) {
            dec->frame[dec->frame_len++] = dec->hdlc_current_byte;
        } else {
            dec->hdlc_receiving = false;
            dec->raw_bits_len = 0U;
            aprs_decoder_reset_frame(dec);
            return;
        }
        dec->hdlc_current_byte = 0U;
        dec->hdlc_bit_index = 0U;
    } else {
        dec->hdlc_current_byte >>= 1;
    }
}

static void aprs_decoder_feed_sample(sa818_radio_handle_t handle, int16_t sample)
{
    if (!handle) {
        return;
    }

    aprs_decoder_state_t *dec = &handle->aprs_dec;
    int16_t delayed = dec->delay_line[dec->delay_idx];
    dec->delay_line[dec->delay_idx] = sample;
    dec->delay_idx = (dec->delay_idx + 1U) % APRS_DEMOD_DELAY_SAMPLES;

    int32_t mixed = (int32_t)sample * (int32_t)delayed;
    int16_t discriminator = aprs_decoder_filter_core(dec->lpf_coeff, dec->lpf_hist, &dec->lpf_index, (int16_t)(mixed >> 7));
    int32_t discriminator_q8 = (int32_t)discriminator << 8;
    dec->discriminator_dc_q8 += (discriminator_q8 - dec->discriminator_dc_q8) >> 6;
    int16_t discriminator_centered = (int16_t)(discriminator - (int16_t)(dec->discriminator_dc_q8 >> 8));

    dec->sampled_bits <<= 1;
    dec->sampled_bits |= (discriminator_centered > 0) ? 1U : 0U;

    if (aprs_signal_transitioned(dec->sampled_bits)) {
        if (dec->current_phase < APRS_PHASE_THRESHOLD) {
            dec->current_phase += APRS_PHASE_INC;
        } else {
            dec->current_phase -= APRS_PHASE_INC;
        }
    }

    dec->current_phase += APRS_PHASE_BITS;
    if (dec->current_phase < APRS_PHASE_MAX) {
        return;
    }

    dec->current_phase %= APRS_PHASE_MAX;
    dec->actual_bits <<= 1;

    uint8_t bit_window = (uint8_t)(dec->sampled_bits & 0x1FU);
    if (aprs_count_ones_u8(bit_window) >= 3U) {
        dec->actual_bits |= 1U;
    }

    uint8_t nrzi_bit = (uint8_t)(!aprs_transition_found(dec->actual_bits));
    aprs_decoder_process_nrzi_bit(handle, nrzi_bit);
}

static void sa818_radio_rx_task(void *arg)
{
    sa818_radio_handle_t handle = (sa818_radio_handle_t)arg;
    const uint32_t sample_rate = handle->cfg.audio_sample_rate_hz;
    const uint32_t base_interval_us = (sample_rate > 0U) ? (1000000U / sample_rate) : 0U;
    const uint32_t interval_remainder = (sample_rate > 0U) ? (1000000U % sample_rate) : 0U;
    uint32_t interval_err = 0U;
    int64_t next_sample_us = esp_timer_get_time();
    int64_t stats_next_us = next_sample_us + 1000000LL;

    int32_t dc_estimate_q8 = 0;
    bool dc_initialized = false;
    uint32_t samples_this_second = 0U;
    int16_t min_demod_sample = INT16_MAX;
    int16_t max_demod_sample = INT16_MIN;
    uint32_t prev_nrzi_bits = 0U;
    uint32_t prev_flags = 0U;
    uint32_t prev_frames = 0U;
    uint32_t prev_crc_ok = 0U;
    uint32_t prev_crc_fail = 0U;

    int16_t block[SA818_RADIO_AUDIO_BLOCK_SAMPLES];
    size_t block_fill = 0;

    while (handle->rx_task_running) {
        int raw = 0;
        esp_err_t ret = adc_oneshot_read(handle->adc_unit, handle->adc_channel, &raw);
        if (ret == ESP_OK) {
            if (!dc_initialized) {
                dc_estimate_q8 = ((int32_t)raw << 8);
                dc_initialized = true;
            }
            int32_t raw_q8 = (int32_t)raw << 8;
            dc_estimate_q8 += (raw_q8 - dc_estimate_q8) >> 7;

            int centered = raw - (int)(dc_estimate_q8 >> 8);
            int demod_scaled = centered >> 4;
            if (demod_scaled > 127) {
                demod_scaled = 127;
            } else if (demod_scaled < -128) {
                demod_scaled = -128;
            }
            int16_t demod_sample = (int16_t)demod_scaled;
            int audio_scaled = centered << 4;
            if (audio_scaled > 32767) {
                audio_scaled = 32767;
            } else if (audio_scaled < -32768) {
                audio_scaled = -32768;
            }
            int16_t audio_sample = (int16_t)audio_scaled;
            aprs_decoder_feed_sample(handle, demod_sample);
            samples_this_second++;
            if (demod_sample < min_demod_sample) {
                min_demod_sample = demod_sample;
            }
            if (demod_sample > max_demod_sample) {
                max_demod_sample = demod_sample;
            }

            sa818_radio_audio_rx_cb_t cb = handle->audio_rx_cb;
            if (cb != NULL) {
                block[block_fill++] = audio_sample;
                if (block_fill >= SA818_RADIO_AUDIO_BLOCK_SAMPLES) {
                    cb(block, block_fill, handle->audio_rx_ctx);
                    block_fill = 0;
                }
            }
        }

        if (base_interval_us == 0U) {
            vTaskDelay(pdMS_TO_TICKS(1));
            continue;
        }

        uint32_t wait_us = base_interval_us;
        interval_err += interval_remainder;
        if (interval_err >= sample_rate) {
            interval_err -= sample_rate;
            wait_us += 1U;
        }

