geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
        next_sample_us += (int64_t)wait_us;
        int64_t now_us = esp_timer_get_time();
        if (now_us >= stats_next_us) {
            aprs_decoder_state_t *dec = &handle->aprs_dec;
            uint32_t bits_delta = dec->nrzi_bits - prev_nrzi_bits;
            uint32_t flags_delta = dec->flag_seen - prev_flags;
            uint32_t frames_delta = dec->frame_candidates - prev_frames;
            uint32_t crc_ok_delta = dec->crc_ok - prev_crc_ok;
            uint32_t crc_fail_delta = dec->crc_fail - prev_crc_fail;
            prev_nrzi_bits = dec->nrzi_bits;
            prev_flags = dec->flag_seen;
            prev_frames = dec->frame_candidates;
            prev_crc_ok = dec->crc_ok;
            prev_crc_fail = dec->crc_fail;

            ESP_LOGI(TAG, "APRS RX stats: %u sps demod=[%d,%d] offset=%d bits=%u flags=%u frames=%u ok=%u fail=%u",
                     (unsigned)samples_this_second,
                     (int)min_demod_sample,
                     (int)max_demod_sample,
                     (int)(dc_estimate_q8 >> 8),
                     (unsigned)bits_delta,
                     (unsigned)flags_delta,
                     (unsigned)frames_delta,
                     (unsigned)crc_ok_delta,
                     (unsigned)crc_fail_delta);
            samples_this_second = 0U;
            min_demod_sample = INT16_MAX;
            max_demod_sample = INT16_MIN;
            stats_next_us = now_us + 1000000LL;
        }

        if (next_sample_us > now_us) {
            esp_rom_delay_us((uint32_t)(next_sample_us - now_us));
        } else if ((now_us - next_sample_us) > 500000LL) {
            // Recover from long scheduler stalls.
            next_sample_us = now_us;
        }
    }

    handle->rx_task = NULL;
    vTaskDelete(NULL);
}

typedef struct {
#if CONFIG_IDF_TARGET_ESP32
    uint16_t phase_acc;
    uint16_t pcm_block[APRS_I2S_TX_BLOCK_SAMPLES];
    size_t pcm_fill;
    size_t i2s_bytes_written;
#endif
    float phase;
    int64_t next_sample_us;
} aprs_tx_stream_t;

static esp_err_t aprs_tx_stream_flush(sa818_radio_handle_t handle, aprs_tx_stream_t *stream)
{
#if CONFIG_IDF_TARGET_ESP32
    if (handle->i2s_tx_ready && stream->pcm_fill > 0) {
        size_t bytes_written = 0;
        esp_err_t ret = i2s_write(I2S_NUM_0,
                                  (const char *)stream->pcm_block,
                                  stream->pcm_fill * sizeof(uint16_t),
                                  &bytes_written,
                                  portMAX_DELAY);
        stream->i2s_bytes_written += bytes_written;
        stream->pcm_fill = 0;
        if (ret != ESP_OK) {
            return ret;
        }
    }
#else
    (void)handle;
    (void)stream;
#endif
    return ESP_OK;
}

static void aprs_tx_stream_init(sa818_radio_handle_t handle, aprs_tx_stream_t *stream)
{
    memset(stream, 0, sizeof(*stream));
    if (!handle->dac_ready) {
        return;
    }
    stream->phase = 0.0f;
    stream->next_sample_us = esp_timer_get_time();
}

static esp_err_t aprs_tx_symbol(sa818_radio_handle_t handle,
                                bool mark_tone,
                                aprs_tx_stream_t *stream)
{
#if CONFIG_IDF_TARGET_ESP32
    if (handle->i2s_tx_ready) {
        const uint16_t phase_inc = mark_tone ? APRS_I2S_PHASE_MARK_INC : APRS_I2S_PHASE_SPACE_INC;
        for (size_t i = 0; i < APRS_I2S_SAMPLES_PER_BIT; i++) {
            uint8_t sample = aprs_sin_sample(stream->phase_acc);
            stream->phase_acc = (uint16_t)((stream->phase_acc + phase_inc) % APRS_I2S_SIN_LEN);
            // Match APRS-ESP RF scaling: avoid overdriving SA818 mic input.
            uint16_t pcm = (uint16_t)(((uint16_t)sample << APRS_I2S_RF_LEVEL_SHIFT) + APRS_I2S_RF_LEVEL_OFFSET);
            // In stereo-framed I2S mode, duplicate the sample across both slots.
            stream->pcm_block[stream->pcm_fill++] = pcm;
            stream->pcm_block[stream->pcm_fill++] = pcm;
            if (stream->pcm_fill >= APRS_I2S_TX_BLOCK_SAMPLES - 1U) {
                esp_err_t ret = aprs_tx_stream_flush(handle, stream);
                if (ret != ESP_OK) {
                    return ret;
                }
            }
        }
        return ESP_OK;
    }
#endif

    const float freq = mark_tone ? APRS_MARK_FREQ_HZ : APRS_SPACE_FREQ_HZ;
    const float step = (float)(2.0 * M_PI * freq / (double)APRS_SAMPLE_RATE_HZ);

    for (size_t i = 0; i < APRS_SAMPLES_PER_BIT; i++) {
        int sample = 128 + (int)(38.0f * sinf(stream->phase));
        if (sample < 0) {
            sample = 0;
        } else if (sample > 255) {
            sample = 255;
        }

        esp_err_t ret = dac_oneshot_output_voltage(handle->dac_handle, (uint8_t)sample);
        if (ret != ESP_OK) {
            return ret;
        }

        stream->phase += step;
        if (stream->phase >= (float)(2.0 * M_PI)) {
            stream->phase -= (float)(2.0 * M_PI);
        }

        stream->next_sample_us += (1000000U / APRS_SAMPLE_RATE_HZ);
        int64_t now_us = esp_timer_get_time();
        if (stream->next_sample_us > now_us) {
            esp_rom_delay_us((uint32_t)(stream->next_sample_us - now_us));
        } else {
            stream->next_sample_us = now_us;
        }
    }

    return ESP_OK;
}

static esp_err_t aprs_tx_nrzi_bit(sa818_radio_handle_t handle,
                                  uint8_t bit,
                                  bool *mark_state,
                                  aprs_tx_stream_t *stream)
{
    if ((bit & 0x01U) == 0U) {
        *mark_state = !(*mark_state);
    }
    return aprs_tx_symbol(handle, *mark_state, stream);
}

static esp_err_t aprs_tx_flag(sa818_radio_handle_t handle,
                              bool *mark_state,
                              aprs_tx_stream_t *stream)
{
    const uint8_t flag = 0x7EU;
    for (int bit = 0; bit < 8; bit++) {
        esp_err_t ret = aprs_tx_nrzi_bit(handle, (uint8_t)((flag >> bit) & 0x01U),
                                         mark_state, stream);
        if (ret != ESP_OK) {
            return ret;
        }
    }
    return ESP_OK;
}

