geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
static esp_err_t aprs_tx_data_with_stuffing(sa818_radio_handle_t handle,
                                            const uint8_t *data,
                                            size_t len,
                                            bool *mark_state,
                                            aprs_tx_stream_t *stream)
{
    uint8_t ones = 0;

    for (size_t i = 0; i < len; i++) {
        for (int bit = 0; bit < 8; bit++) {
            uint8_t b = (uint8_t)((data[i] >> bit) & 0x01U);
            esp_err_t ret = aprs_tx_nrzi_bit(handle, b, mark_state, stream);
            if (ret != ESP_OK) {
                return ret;
            }

            if (b != 0U) {
                ones++;
                if (ones == 5U) {
                    ret = aprs_tx_nrzi_bit(handle, 0U, mark_state, stream);
                    if (ret != ESP_OK) {
                        return ret;
                    }
                    ones = 0;
                }
            } else {
                ones = 0;
            }
        }
    }

    return ESP_OK;
}

static esp_err_t build_aprs_message_frame(const char *from_callsign,
                                          const char *to_callsign,
                                          const char *message_text,
                                          uint16_t message_seq,
                                          uint8_t *out_frame,
                                          size_t out_frame_len,
                                          size_t *out_len)
{
    if (!from_callsign || !to_callsign || !message_text || !out_frame || !out_len) {
        return ESP_ERR_INVALID_ARG;
    }

    char src_call[7];
    uint8_t src_ssid = 0;
    if (!parse_callsign_ssid(from_callsign, src_call, sizeof(src_call), &src_ssid)) {
        return ESP_ERR_INVALID_ARG;
    }

    char dst_msg_call[7];
    uint8_t dst_msg_ssid = 0;
    if (!parse_callsign_ssid(to_callsign, dst_msg_call, sizeof(dst_msg_call), &dst_msg_ssid)) {
        return ESP_ERR_INVALID_ARG;
    }

    char addressee[10];
    size_t addressee_len = 0;
    for (size_t i = 0; i < 6 && dst_msg_call[i] != '\0' && addressee_len < sizeof(addressee) - 1; i++) {
        addressee[addressee_len++] = dst_msg_call[i];
    }

    if (dst_msg_ssid != 0 && addressee_len + 2 < sizeof(addressee)) {
        addressee[addressee_len++] = '-';
        if (dst_msg_ssid >= 10) {
            addressee[addressee_len++] = (char)('0' + (dst_msg_ssid / 10));
            addressee[addressee_len++] = (char)('0' + (dst_msg_ssid % 10));
        } else {
            addressee[addressee_len++] = (char)('0' + dst_msg_ssid);
        }
    }
    addressee[addressee_len] = '\0';

    char cleaned_msg[APRS_MAX_INFO_BYTES + 1];
    sanitize_message_text(message_text, cleaned_msg, sizeof(cleaned_msg));

    char info[APRS_MAX_INFO_BYTES + 1];
    snprintf(info, sizeof(info), ":%-9.9s:%.67s{%03u",
             addressee, cleaned_msg, (unsigned)(message_seq % (APRS_MAX_MESSAGE_SEQ + 1U)));
    size_t info_len = strlen(info);

    size_t idx = 0;
    if (out_frame_len < 40 + info_len) {
        return ESP_ERR_INVALID_SIZE;
    }

    encode_ax25_address("APGEO1", 0, false, &out_frame[idx]);
    idx += 7;
    encode_ax25_address(src_call, src_ssid, false, &out_frame[idx]);
    idx += 7;
    encode_ax25_address("WIDE1", 1, false, &out_frame[idx]);
    idx += 7;
    encode_ax25_address("WIDE2", 1, true, &out_frame[idx]);
    idx += 7;

    out_frame[idx++] = 0x03U;
    out_frame[idx++] = 0xF0U;

    memcpy(&out_frame[idx], info, info_len);
    idx += info_len;

    uint16_t fcs = aprs_crc16(out_frame, idx);
    out_frame[idx++] = (uint8_t)(fcs & 0xFFU);
    out_frame[idx++] = (uint8_t)((fcs >> 8) & 0xFFU);

    *out_len = idx;
    return ESP_OK;
}

esp_err_t sa818_radio_create(const sa818_radio_config_t *config, sa818_radio_handle_t *out_handle)
{
    if (!config || !out_handle) {
        return ESP_ERR_INVALID_ARG;
    }

    struct sa818_radio_dev *dev = calloc(1, sizeof(struct sa818_radio_dev));
    if (!dev) {
        return ESP_ERR_NO_MEM;
    }

    dev->cfg = *config;
    dev->bandwidth = config->bandwidth ? 1 : 0;
    dev->squelch = config->squelch > 8 ? 8 : config->squelch;
    dev->high_power = config->high_power;
    dev->tx_freq_mhz = config->tx_freq_mhz > 0.0f ? config->tx_freq_mhz : SA818_RADIO_DEFAULT_APRS_FREQ_MHZ;
    dev->rx_freq_mhz = config->rx_freq_mhz > 0.0f ? config->rx_freq_mhz : SA818_RADIO_DEFAULT_APRS_FREQ_MHZ;
    dev->aprs_freq_mhz = config->aprs_freq_mhz > 0.0f ? config->aprs_freq_mhz : SA818_RADIO_DEFAULT_APRS_FREQ_MHZ;

    if (dev->cfg.audio_sample_rate_hz == 0 || dev->cfg.audio_sample_rate_hz != APRS_SAMPLE_RATE_HZ) {
        dev->cfg.audio_sample_rate_hz = APRS_SAMPLE_RATE_HZ;
    }
    if (dev->cfg.volume > 8) {
        dev->cfg.volume = 8;
    }

    dev->lock = xSemaphoreCreateMutex();
    if (!dev->lock) {
        free(dev);
        return ESP_ERR_NO_MEM;
    }

    esp_err_t ret = sa818_create(&dev->cfg.sa818, &dev->modem);
    if (ret != ESP_OK) {
        vSemaphoreDelete(dev->lock);
        free(dev);
        return ret;
    }

    ret = sa818_radio_configure_squelch_pin(dev);
    if (ret != ESP_OK) {
        sa818_delete(dev->modem);
        vSemaphoreDelete(dev->lock);
        free(dev);
        return ret;
    }

    ret = sa818_radio_configure_adc(dev);
    if (ret != ESP_OK && dev->cfg.audio_in_pin >= 0) {
        ESP_LOGW(TAG, "RX audio capture disabled: %s", esp_err_to_name(ret));
    }

#if CONFIG_IDF_TARGET_ESP32
    ret = sa818_radio_configure_i2s_tx(dev);
    if (ret != ESP_OK && dev->cfg.audio_out_pin >= 0) {
        ESP_LOGW(TAG, "I2S APRS TX unavailable, falling back to DAC oneshot: %s", esp_err_to_name(ret));
    }
#endif

    if (
#if CONFIG_IDF_TARGET_ESP32
        !dev->i2s_tx_ready &&
#endif
        dev->cfg.audio_out_pin >= 0) {
        ret = sa818_radio_configure_dac(dev);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "APRS AFSK TX disabled: %s", esp_err_to_name(ret));
        }
    }

    aprs_decoder_reset_frame(&dev->aprs_dec);
    dev->aprs_dec.hdlc_demod_bits = 0;
    dev->aprs_dec.hdlc_receiving = false;
    aprs_decoder_init_demod(&dev->aprs_dec);

    ret = sa818_radio_power(dev, true);
    if (ret != ESP_OK) {
        if (dev->adc_ready && dev->adc_unit) {
            adc_oneshot_del_unit(dev->adc_unit);
        }
#if CONFIG_IDF_TARGET_ESP32
        if (dev->i2s_tx_ready) {
            i2s_driver_uninstall(I2S_NUM_0);
            dev->i2s_tx_ready = false;
        }
#endif
        if (dev->dac_ready && dev->dac_handle) {
            dac_oneshot_del_channel(dev->dac_handle);
        }
        sa818_delete(dev->modem);
        vSemaphoreDelete(dev->lock);
        free(dev);
        return ret;
    }

    *out_handle = dev;
    return ESP_OK;
}

esp_err_t sa818_radio_delete(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

