geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
    sa818_radio_stop_audio_rx(handle);
    sa818_radio_power(handle, false);

    if (handle->adc_ready && handle->adc_unit != NULL) {
        adc_oneshot_del_unit(handle->adc_unit);
        handle->adc_unit = NULL;
        handle->adc_ready = false;
    }

    if (handle->dac_ready && handle->dac_handle != NULL) {
        dac_oneshot_del_channel(handle->dac_handle);
        handle->dac_handle = NULL;
        handle->dac_ready = false;
    }
#if CONFIG_IDF_TARGET_ESP32
    if (handle->i2s_tx_ready) {
        i2s_driver_uninstall(I2S_NUM_0);
        handle->i2s_tx_ready = false;
    }
#endif

    if (handle->modem != NULL) {
        sa818_delete(handle->modem);
        handle->modem = NULL;
    }

    if (handle->lock) {
        vSemaphoreDelete(handle->lock);
        handle->lock = NULL;
    }

    free(handle);
    return ESP_OK;
}

sa818_handle_t sa818_radio_get_modem(sa818_radio_handle_t handle)
{
    return handle ? handle->modem : NULL;
}

esp_err_t sa818_radio_power(sa818_radio_handle_t handle, bool enabled)
{
    if (!handle || !handle->modem) {
        return ESP_ERR_INVALID_ARG;
    }

    if (xSemaphoreTake(handle->lock, pdMS_TO_TICKS(1000)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    esp_err_t ret = ESP_OK;

    if (!enabled) {
        sa818_set_tx(handle->modem, false);
        ret = sa818_power(handle->modem, false);
        if (ret == ESP_OK) {
            handle->powered = false;
            handle->ptt_enabled = false;
        }
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_power(handle->modem, true);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_handshake(handle->modem, 2500);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_set_tx(handle->modem, false);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_set_high_power(handle->modem, handle->high_power);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_set_volume(handle->modem, handle->cfg.volume, SA818_RADIO_CMD_TIMEOUT_MS);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_set_filters(handle->modem, true, true, true, SA818_RADIO_CMD_TIMEOUT_MS);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_set_tail(handle->modem, 0, SA818_RADIO_CMD_TIMEOUT_MS);
    if (ret != ESP_OK) {
        xSemaphoreGive(handle->lock);
        return ret;
    }

    ret = sa818_radio_apply_group(handle);
    if (ret == ESP_OK) {
        handle->powered = true;
        handle->ptt_enabled = false;
    }

    xSemaphoreGive(handle->lock);
    return ret;
}

bool sa818_radio_is_powered(sa818_radio_handle_t handle)
{
    return handle ? handle->powered : false;
}

esp_err_t sa818_radio_set_high_power(sa818_radio_handle_t handle, bool high_power)
{
    if (!handle || !handle->modem) {
        return ESP_ERR_INVALID_ARG;
    }

    handle->high_power = high_power;
    if (!handle->powered) {
        return ESP_OK;
    }
    return sa818_set_high_power(handle->modem, high_power);
}

bool sa818_radio_is_high_power(sa818_radio_handle_t handle)
{
    return handle ? handle->high_power : false;
}

esp_err_t sa818_radio_set_ptt(sa818_radio_handle_t handle, bool tx_enabled)
{
    if (!handle || !handle->modem) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!handle->powered) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t ret = sa818_set_tx(handle->modem, tx_enabled);
    if (ret == ESP_OK) {
        handle->ptt_enabled = tx_enabled;
    }
    return ret;
}

bool sa818_radio_is_ptt_enabled(sa818_radio_handle_t handle)
{
    return handle ? handle->ptt_enabled : false;
}

esp_err_t sa818_radio_set_frequency(sa818_radio_handle_t handle, float tx_freq_mhz, float rx_freq_mhz)
{
    if (!handle || tx_freq_mhz <= 0.0f || rx_freq_mhz <= 0.0f) {
        return ESP_ERR_INVALID_ARG;
    }

    handle->tx_freq_mhz = tx_freq_mhz;
    handle->rx_freq_mhz = rx_freq_mhz;

    if (!handle->powered) {
        return ESP_OK;
    }
    return sa818_radio_apply_group(handle);
}

esp_err_t sa818_radio_get_frequency(sa818_radio_handle_t handle, float *tx_freq_mhz, float *rx_freq_mhz)
{
    if (!handle || !tx_freq_mhz || !rx_freq_mhz) {
        return ESP_ERR_INVALID_ARG;
    }

    *tx_freq_mhz = handle->tx_freq_mhz;
    *rx_freq_mhz = handle->rx_freq_mhz;
    return ESP_OK;
}

esp_err_t sa818_radio_set_squelch(sa818_radio_handle_t handle, uint8_t squelch)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    if (squelch > 8) {
        squelch = 8;
    }

    handle->squelch = squelch;
    if (!handle->powered) {
        return ESP_OK;
    }
    return sa818_radio_apply_group(handle);
}

esp_err_t sa818_radio_get_squelch(sa818_radio_handle_t handle, uint8_t *squelch)
{
    if (!handle || !squelch) {
        return ESP_ERR_INVALID_ARG;
    }

    *squelch = handle->squelch;
    return ESP_OK;
}

esp_err_t sa818_radio_get_squelch_state(sa818_radio_handle_t handle, bool *squelched)
{
    if (!handle || !squelched) {
        return ESP_ERR_INVALID_ARG;
    }
    if (handle->cfg.squelch_pin < 0) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    int level = gpio_get_level((gpio_num_t)handle->cfg.squelch_pin);
    *squelched = (level != 0);
    return ESP_OK;
}

esp_err_t sa818_radio_start_audio_rx(sa818_radio_handle_t handle,
                                     sa818_radio_audio_rx_cb_t callback,
                                     void *user_ctx)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!handle->adc_ready) {
        return ESP_ERR_NOT_SUPPORTED;
    }
    if (handle->rx_task_running) {
        return ESP_ERR_INVALID_STATE;
    }

    aprs_decoder_reset_frame(&handle->aprs_dec);
    handle->aprs_dec.hdlc_demod_bits = 0;
    handle->aprs_dec.hdlc_receiving = false;
    aprs_decoder_init_demod(&handle->aprs_dec);

    handle->audio_rx_cb = callback;
    handle->audio_rx_ctx = user_ctx;
    handle->rx_task_running = true;

