geograms/geogram/esp32/components/geogram_sa818/sa818_radio.c
    BaseType_t ok = xTaskCreate(sa818_radio_rx_task,
                                "sa818_rx",
                                SA818_RADIO_RX_TASK_STACK,
                                handle,
                                SA818_RADIO_RX_TASK_PRIO,
                                &handle->rx_task);
    if (ok != pdPASS) {
        handle->rx_task_running = false;
        handle->rx_task = NULL;
        return ESP_FAIL;
    }

    return ESP_OK;
}

esp_err_t sa818_radio_stop_audio_rx(sa818_radio_handle_t handle)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!handle->rx_task_running) {
        return ESP_OK;
    }

    handle->rx_task_running = false;

    for (int i = 0; i < 50; i++) {
        if (handle->rx_task == NULL) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    if (handle->rx_task != NULL) {
        vTaskDelete(handle->rx_task);
        handle->rx_task = NULL;
    }

    handle->audio_rx_cb = NULL;
    handle->audio_rx_ctx = NULL;
    return ESP_OK;
}

bool sa818_radio_is_audio_rx_running(sa818_radio_handle_t handle)
{
    return handle ? handle->rx_task_running : false;
}

esp_err_t sa818_radio_set_aprs_frequency(sa818_radio_handle_t handle, float aprs_freq_mhz)
{
    if (!handle || aprs_freq_mhz <= 0.0f) {
        return ESP_ERR_INVALID_ARG;
    }

    handle->aprs_freq_mhz = aprs_freq_mhz;
    return sa818_radio_set_frequency(handle, aprs_freq_mhz, aprs_freq_mhz);
}

float sa818_radio_get_aprs_frequency(sa818_radio_handle_t handle)
{
    return handle ? handle->aprs_freq_mhz : 0.0f;
}

bool sa818_radio_is_aprs_tx_supported(sa818_radio_handle_t handle)
{
    if (!handle) {
        return false;
    }

    bool supported = handle->dac_ready;
#if CONFIG_IDF_TARGET_ESP32
    supported = supported || handle->i2s_tx_ready;
#endif
    return supported;
}

bool sa818_radio_is_aprs_tx_i2s(sa818_radio_handle_t handle)
{
#if CONFIG_IDF_TARGET_ESP32
    return handle ? handle->i2s_tx_ready : false;
#else
    (void)handle;
    return false;
#endif
}

esp_err_t sa818_radio_set_aprs_rx_callback(sa818_radio_handle_t handle,
                                           sa818_aprs_rx_cb_t callback,
                                           void *user_ctx)
{
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

    handle->aprs_rx_cb = callback;
    handle->aprs_rx_ctx = user_ctx;
    return ESP_OK;
}

esp_err_t sa818_radio_send_aprs_message(sa818_radio_handle_t handle,
                                        const char *from_callsign,
                                        const char *to_callsign,
                                        const char *message_text)
{
    if (!handle || !from_callsign || !to_callsign || !message_text) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!sa818_radio_is_aprs_tx_supported(handle)) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (!handle->powered) {
        esp_err_t ret = sa818_radio_power(handle, true);
        if (ret != ESP_OK) {
            return ret;
        }
    }

    uint8_t frame[APRS_MAX_FRAME_BYTES];
    size_t frame_len = 0;
    uint16_t message_seq = handle->aprs_message_seq;
    handle->aprs_message_seq = (uint16_t)((handle->aprs_message_seq + 1U) % (APRS_MAX_MESSAGE_SEQ + 1U));
    esp_err_t ret = build_aprs_message_frame(from_callsign, to_callsign, message_text, message_seq,
                                             frame, sizeof(frame), &frame_len);
    if (ret != ESP_OK) {
        return ret;
    }

    ret = sa818_radio_set_frequency(handle, handle->aprs_freq_mhz, handle->aprs_freq_mhz);
    if (ret != ESP_OK) {
        return ret;
    }

#if CONFIG_IDF_TARGET_ESP32
    if (handle->i2s_tx_ready) {
        i2s_zero_dma_buffer(I2S_NUM_0);
    }
#endif

    ESP_LOGI(TAG, "APRS TX backend: %s",
             sa818_radio_is_aprs_tx_i2s(handle) ? "I2S+DAC" : "DAC oneshot");

    ret = sa818_radio_set_ptt(handle, true);
    if (ret != ESP_OK) {
        return ret;
    }

    vTaskDelay(pdMS_TO_TICKS(APRS_TX_LEAD_MS));

    bool mark_state = true;
    aprs_tx_stream_t stream;
    aprs_tx_stream_init(handle, &stream);

    for (size_t i = 0; i < APRS_PREAMBLE_FLAGS; i++) {
        ret = aprs_tx_flag(handle, &mark_state, &stream);
        if (ret != ESP_OK) {
            break;
        }
    }

    if (ret == ESP_OK) {
        ret = aprs_tx_data_with_stuffing(handle, frame, frame_len, &mark_state, &stream);
    }

    if (ret == ESP_OK) {
        for (size_t i = 0; i < APRS_TAIL_FLAGS; i++) {
            ret = aprs_tx_flag(handle, &mark_state, &stream);
            if (ret != ESP_OK) {
                break;
            }
        }
    }

    if (ret == ESP_OK) {
        ret = aprs_tx_stream_flush(handle, &stream);
    }

#if CONFIG_IDF_TARGET_ESP32
    if (ret == ESP_OK && handle->i2s_tx_ready) {
        uint16_t zeros[APRS_I2S_TX_BLOCK_SAMPLES];
        memset(zeros, 0, sizeof(zeros));
        for (int i = 0; i < 4; i++) {
            size_t bytes_written = 0;
            esp_err_t wr = i2s_write(I2S_NUM_0,
                                     (const char *)zeros,
                                     sizeof(zeros),
                                     &bytes_written,
                                     portMAX_DELAY);
            if (wr != ESP_OK) {
                ret = wr;
                break;
            }
        }
    }
    if (handle->i2s_tx_ready) {
        ESP_LOGI(TAG, "APRS TX I2S bytes written: %u", (unsigned)stream.i2s_bytes_written);
    }
#endif

    if (handle->dac_ready) {
        dac_oneshot_output_voltage(handle->dac_handle, 128);
    }
    vTaskDelay(pdMS_TO_TICKS(APRS_TX_TAIL_MS));
    sa818_radio_set_ptt(handle, false);

    return ret;
}
